# Найти сумму чисел списка стоящих на нечетной позиции
# Пример:[1,2,3,4] -> 4

a = [1, 2, 3, 4]
sum = 0
for e in range(1, len(a)+1, 2):
    sum += e
print(sum)
