# Дан список чисел. Создать список в который попадают числа,
# описывающие возрастающую последовательность и содержащие максимальное количество элементов.
# Пример: [1, 5, 2, 3, 4, 6, 1, 7] => [1, 2, 3, 4, 6, 7]
# [5, 2, 3, 4, 6, 1, 7] => [2, 3, 4, 6, 7]
#  Порядок элементов менять нельзя

list_in = [1, 5, 2, 3, 4, 6, 1, 7]

# def sorting(not_sorted_list):
#     list_out = [not_sorted_list[0]]
#     for i in not_sorted_list:
#         if i > max(list_out):
#             list_out.append(i)
#             print('add', i)
#     return list_out

def sorting(not_sorted_list):
     list_out = [not_sorted_list[0]]
     i+1


print(sorting(list_in))





